# üéà Îç∞Ïù¥ÌÑ∞ ÌîÑÎ†àÏûÑ

In [1]:
import pandas as pd
import numpy as np

##  ‚úî Î¶¨Ïä§Ìä∏Î°ú Îç∞Ïù¥ÌÑ∞ ÌîÑÎ†àÏûÑ ÎßåÎì§Í∏∞
* DataFrame([[list1],[list2]])
* Í∞Å listÎäî Ìïú ÌñâÏúºÎ°ú Íµ¨ÏÑ±Îê®
* ÌñâÏùò ÏõêÏÜå Í∞úÏàòÍ∞Ä Îã§Î•¥Î©¥ NoneÍ∞íÏúºÎ°ú Ï†ÄÏû•

In [2]:
# 2Ï∞®Ïõê Î¶¨Ïä§Ìä∏Î°ú Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑ ÏÉùÏÑ±
df = pd.DataFrame([['a','b','c'],['a','a','g'],['a','a']])
df

   0  1     2
0  a  b     c
1  a  a     g
2  a  a  None

## ‚úî ÎîïÏÖîÎÑàÎ¶¨Î°ú Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑ ÏÉùÏÑ±
* dictÏùò key => column

In [4]:
df1 = pd.DataFrame({'A':[90,80,70],
                    'B':[85,98,75],
                    'C':[88,99,77],
                    'D':[87,89,86]})
df1

    A   B   C   D
0  90  85  88  87
1  80  98  99  89
2  70  75  77  86

In [8]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2000002],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "ÏßÄÏó≠": ["ÏàòÎèÑÍ∂å", "Í≤ΩÏÉÅÍ∂å", "ÏàòÎèÑÍ∂å", "Í≤ΩÏÉÅÍ∂å"],
    "2010-2015 Ï¶ùÍ∞ÄÏú®":[0.0283, 0.0163, 0.0982,0.0141]
}
data

{'2015': [9904312, 3448737, 2890451, 2466052],
 '2010': [9631482, 3393191, 2632035, 2000002],
 '2005': [9762546, 3512547, 2517680, 2456016],
 '2000': [9853972, 3655437, 2466338, 2473990],
 'ÏßÄÏó≠': ['ÏàòÎèÑÍ∂å', 'Í≤ΩÏÉÅÍ∂å', 'ÏàòÎèÑÍ∂å', 'Í≤ΩÏÉÅÍ∂å'],
 '2010-2015 Ï¶ùÍ∞ÄÏú®': [0.0283, 0.0163, 0.0982, 0.0141]}

In [30]:
# Ïó¥Î∞©Ìñ• Ïù∏Îç±Ïä§ columns
columns = ['ÏßÄÏó≠','2015','2010','2005','2000','2010-2015 Ï¶ùÍ∞ÄÏú®']

# ÌñâÎ∞©Ìñ• Ïù∏Îç±Ïä§ 
index = ['ÏÑúÏö∏','Î∂ÄÏÇ∞','Ïù∏Ï≤ú','ÎåÄÍµ¨']

# DataFrame
df2 = pd.DataFrame(data, index=index, columns=columns)
df2

     ÏßÄÏó≠     2015     2010     2005     2000  2010-2015 Ï¶ùÍ∞ÄÏú®
ÏÑúÏö∏  ÏàòÎèÑÍ∂å  9904312  9631482  9762546  9853972         0.0283
Î∂ÄÏÇ∞  Í≤ΩÏÉÅÍ∂å  3448737  3393191  3512547  3655437         0.0163
Ïù∏Ï≤ú  ÏàòÎèÑÍ∂å  2890451  2632035  2517680  2466338         0.0982
ÎåÄÍµ¨  Í≤ΩÏÉÅÍ∂å  2466052  2000002  2456016  2473990         0.0141

## ‚úî ÏãúÎ¶¨Ï¶àÎ°ú Îç∞Ïù¥ÌÑ∞ ÌîÑÎ†àÏûÑ ÏÉùÏÑ±
* Í∞Å SeriesÏùò Ïù∏Îç±Ïä§ => column

In [31]:
a = pd.Series([100, 200, 300], ['a','b','d'])
b = pd.Series([101, 201, 301], ['a','b','k'])
c = pd.Series([110, 210, 310], ['a','b','c'])

pd.DataFrame([a,b,c], index=[100,101,102])

         a      b      d      k      c
100  100.0  200.0  300.0    NaN    NaN
101  101.0  201.0    NaN  301.0    NaN
102  110.0  210.0    NaN    NaN  310.0

## ‚úî csv Îç∞Ïù¥ÌÑ∞Î°úÎ∂ÄÌÑ∞ Dataframe ÏÉùÏÑ±
* Îç∞Ïù¥ÌÑ∞ Î∂ÑÏÑùÏùÑ ÏúÑÌï¥, dataframeÏùÑ ÏÉùÏÑ±ÌïòÎäî Í∞ÄÏû• ÏùºÎ∞òÏ†ÅÏù∏ Î∞©Î≤ï
* Îç∞Ïù¥ÌÑ∞ ÏÜåÏä§Î°úÎ∂ÄÌÑ∞ Ï∂îÏ∂úÎêú csvÌååÏùºÎ°úÎ∂ÄÌÑ∞ ÏÉùÏÑ±
* pandas.read_csv() Ìï®Ïàò ÏÇ¨Ïö©
* https://www.kaggle.com/hesh97/titanicdataset-traincsv/data

In [13]:
trainData = pd.read_csv('c:/Anaconda/train.csv')
trainData.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [17]:
# index_col : indexÎ°ú ÏÇ¨Ïö©Ìï† column ÏÑ§Ï†ï
# usecols : ÏÇ¨Ïö©Ìï† Îç∞Ïù¥ÌÑ∞Î™ÖÏùÑ Ï†ÅÏùå

trainData = pd.read_csv('c:/Anaconda/train.csv', 
                        index_col='PassengerId',
                        usecols=['PassengerId','Survived','Pclass','Name'])
trainData

,Survived,Pclass,Name
PassengerId,,,
1,0,3,"Braund, Mr. Owen Harris"
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th..."
3,1,3,"Heikkinen, Miss. Laina"
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)"
5,0,3,"Allen, Mr. William Henry"
...,...,...,...
887,0,2,"Montvila, Rev. Juozas"
888,1,1,"Graham, Miss. Margaret Edith"
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie"""
890,1,1,"Behr, Mr. Karl Howell"
891,0,3,"Dooley, Mr. Patrick"

In [32]:
df2

     ÏßÄÏó≠     2015     2010     2005     2000  2010-2015 Ï¶ùÍ∞ÄÏú®
ÏÑúÏö∏  ÏàòÎèÑÍ∂å  9904312  9631482  9762546  9853972         0.0283
Î∂ÄÏÇ∞  Í≤ΩÏÉÅÍ∂å  3448737  3393191  3512547  3655437         0.0163
Ïù∏Ï≤ú  ÏàòÎèÑÍ∂å  2890451  2632035  2517680  2466338         0.0982
ÎåÄÍµ¨  Í≤ΩÏÉÅÍ∂å  2466052  2000002  2456016  2473990         0.0141

In [21]:
# Ïó¥Î∞©Ìñ• Ïù∏Îç±Ïä§ Ï∂úÎ†•
df2.columns

Index(['ÏßÄÏó≠', '2015', '2010', '2005', '2000', '2010~2015 Ï¶ùÍ∞ÄÏú®'], dtype='object')

In [22]:
# ÌñâÎ∞©Ìñ• Ïù∏Îç±Ïä§ Ï∂úÎ†•
df2.index

Index(['ÏÑúÏö∏', 'Î∂ÄÏÇ∞', 'Ïù∏Ï≤ú', 'ÎåÄÍµ¨'], dtype='object')

## ‚úî Ìñâ/Ïó¥ Ïù∏Îç±Ïä§ Ïù¥Î¶Ñ ÏÑ§Ï†ï
* index.name
* columns.name

In [33]:
df2.index.name = 'ÎèÑÏãú'
df2.columns.name = 'ÌäπÏÑ±'
df2

ÌäπÏÑ±   ÏßÄÏó≠     2015     2010     2005     2000  2010-2015 Ï¶ùÍ∞ÄÏú®
ÎèÑÏãú
ÏÑúÏö∏  ÏàòÎèÑÍ∂å  9904312  9631482  9762546  9853972         0.0283
Î∂ÄÏÇ∞  Í≤ΩÏÉÅÍ∂å  3448737  3393191  3512547  3655437         0.0163
Ïù∏Ï≤ú  ÏàòÎèÑÍ∂å  2890451  2632035  2517680  2466338         0.0982
ÎåÄÍµ¨  Í≤ΩÏÉÅÍ∂å  2466052  2000002  2456016  2473990         0.0141

In [34]:
# Îç∞Ïù¥ÌÑ∞Îßå Ï†ëÍ∑ºÌïòÎ†§Î©¥ values ÏÜçÏÑ±ÏùÑ ÏÇ¨Ïö©
# Î∞òÌôòÍ∞íÏùÄ array ÌòïÌÉú

df2.values

array([['ÏàòÎèÑÍ∂å', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['Í≤ΩÏÉÅÍ∂å', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['ÏàòÎèÑÍ∂å', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['Í≤ΩÏÉÅÍ∂å', 2466052, 2000002, 2456016, 2473990, 0.0141]], dtype=object)

## ‚úî Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑÏùò Îç∞Ïù¥ÌÑ∞ ÌååÏïÖÌïòÍ∏∞

In [25]:
# DataFrameÏùò Í∞úÏöî Ï∂úÎ†•
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, ÏÑúÏö∏ to ÎåÄÍµ¨
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   ÏßÄÏó≠             4 non-null      object
 1   2015           4 non-null      int64
 2   2010           4 non-null      int64
 3   2005           4 non-null      int64
 4   2000           4 non-null      int64
 5   2010~2015 Ï¶ùÍ∞ÄÏú®  0 non-null      object
dtypes: int64(4), object(2)
memory usage: 224.0+ bytes

In [26]:
# DataFrameÏùò ÌÜµÍ≥ÑÏ†Å Í∞úÏöî Ï∂úÎ†•
df2.describe()

ÌäπÏÑ±             2015          2010          2005          2000
count  4.000000e+00  4.000000e+00  4.000000e+00  4.000000e+00
mean   4.677388e+06  4.414178e+06  4.562197e+06  4.612434e+06
std    3.507776e+06  3.524531e+06  3.500545e+06  3.538749e+06
min    2.466052e+06  2.000002e+06  2.456016e+06  2.466338e+06
25%    2.784351e+06  2.474027e+06  2.502264e+06  2.472077e+06
50%    3.169594e+06  3.012613e+06  3.015114e+06  3.064714e+06
75%    5.062631e+06  4.952764e+06  5.075047e+06  5.205071e+06
max    9.904312e+06  9.631482e+06  9.762546e+06  9.853972e+06

In [27]:
# Îç∞Ïù¥ÌÑ∞ ÌîÑÎ†àÏûÑÏùò Ìñâ,Î†¨ Í∞úÏàò Ï∂úÎ†•
df2.shape

(4, 6)

In [35]:
df2

ÌäπÏÑ±   ÏßÄÏó≠     2015     2010     2005     2000  2010-2015 Ï¶ùÍ∞ÄÏú®
ÎèÑÏãú
ÏÑúÏö∏  ÏàòÎèÑÍ∂å  9904312  9631482  9762546  9853972         0.0283
Î∂ÄÏÇ∞  Í≤ΩÏÉÅÍ∂å  3448737  3393191  3512547  3655437         0.0163
Ïù∏Ï≤ú  ÏàòÎèÑÍ∂å  2890451  2632035  2517680  2466338         0.0982
ÎåÄÍµ¨  Í≤ΩÏÉÅÍ∂å  2466052  2000002  2456016  2473990         0.0141

In [28]:
# Ï†ÑÏπò : ÌñâÍ≥º Ïó¥Ïùò ÏúÑÏπòÎ•º Î∞îÍøà
dfT = df2.T    # Îî∞Î°ú Í∞ùÏ≤¥Î•º ÏßÄÏ†ïÌïòÎ©¥ ÏõêÎ≥∏Îç∞Ïù¥ÌÑ∞Î•º Î∞îÍæ∏ÏßÄ ÏïäÍ≥† Ï†ÑÏπòÌï† Ïàò ÏûàÏùå
dfT

ÎèÑÏãú                  ÏÑúÏö∏       Î∂ÄÏÇ∞       Ïù∏Ï≤ú       ÎåÄÍµ¨
ÌäπÏÑ±
ÏßÄÏó≠                 ÏàòÎèÑÍ∂å      Í≤ΩÏÉÅÍ∂å      ÏàòÎèÑÍ∂å      Í≤ΩÏÉÅÍ∂å
2015           9904312  3448737  2890451  2466052
2010           9631482  3393191  2632035  2000002
2005           9762546  3512547  2517680  2456016
2000           9853972  3655437  2466338  2473990
2010~2015 Ï¶ùÍ∞ÄÏú®      NaN      NaN      NaN      NaN

In [43]:
# Ïó¥Ï∂îÍ∞Ä : Ï¶ùÍ∞ÄÏú® Î≥ÄÍ≤Ω
df2['2010-2015Ï¶ùÍ∞ÄÏú®'] = df2['2010-2015Ï¶ùÍ∞ÄÏú®']*100
df2

ÌäπÏÑ±   ÏßÄÏó≠     2015     2010     2005     2000  2010-2015Ï¶ùÍ∞ÄÏú®  2000-2015Ï¶ùÍ∞ÄÏú®
ÎèÑÏãú
ÏÑúÏö∏  ÏàòÎèÑÍ∂å  9904312  9631482  9762546  9853972       28300.0          1.45
Î∂ÄÏÇ∞  Í≤ΩÏÉÅÍ∂å  3448737  3393191  3512547  3655437       16300.0         -1.82
Ïù∏Ï≤ú  ÏàòÎèÑÍ∂å  2890451  2632035  2517680  2466338       98200.0         14.81
ÎåÄÍµ¨  Í≤ΩÏÉÅÍ∂å  2466052  2000002  2456016  2473990       14100.0          0.41

In [37]:
df2['2000-2015Ï¶ùÍ∞ÄÏú®'] = ((df2['2015'] - df2['2005'])/df2['2005']*100).round(2)
df2

ÌäπÏÑ±,ÏßÄÏó≠,2015,2010,2005,2000,2010-2015 Ï¶ùÍ∞ÄÏú®,2010-2015Ï¶ùÍ∞ÄÏú®,2000-2015Ï¶ùÍ∞ÄÏú®
ÎèÑÏãú,,,,,,,,
ÏÑúÏö∏,ÏàòÎèÑÍ∂å,9904312,9631482,9762546,9853972,0.0283,2.83,1.45
Î∂ÄÏÇ∞,Í≤ΩÏÉÅÍ∂å,3448737,3393191,3512547,3655437,0.0163,1.63,-1.82
Ïù∏Ï≤ú,ÏàòÎèÑÍ∂å,2890451,2632035,2517680,2466338,0.0982,9.82,14.81
ÎåÄÍµ¨,Í≤ΩÏÉÅÍ∂å,2466052,2000002,2456016,2473990,0.0141,1.41,0.41

In [39]:
# Ïó¥ ÏÇ≠Ï†ú
del df2['2010-2015 Ï¶ùÍ∞ÄÏú®']
df2

ÌäπÏÑ±   ÏßÄÏó≠     2015     2010     2005     2000  2010-2015Ï¶ùÍ∞ÄÏú®  2000-2015Ï¶ùÍ∞ÄÏú®
ÎèÑÏãú
ÏÑúÏö∏  ÏàòÎèÑÍ∂å  9904312  9631482  9762546  9853972          2.83          1.45
Î∂ÄÏÇ∞  Í≤ΩÏÉÅÍ∂å  3448737  3393191  3512547  3655437          1.63         -1.82
Ïù∏Ï≤ú  ÏàòÎèÑÍ∂å  2890451  2632035  2517680  2466338          9.82         14.81
ÎåÄÍµ¨  Í≤ΩÏÉÅÍ∂å  2466052  2000002  2456016  2473990          1.41          0.41

## üéàÎç∞Ïù¥ÌÑ∞ ÌîÑÎ†àÏûÑ Ïù∏Îç±Ïã±
1. Ïó¥Ïù∏Îç±Ïã±
2. Ïù∏Îç±ÏÑúÎ•º ÏÇ¨Ïö©ÌïòÏßÄ ÏïäÎäî Ìñâ Ïù∏Îç±Ïã±

## ‚úî Ïó¥Ïù∏Îç±Ïã±

In [44]:
# Ïù∏Îç±Ïä§Î°ú ÎùºÎ≤®Í∞í 1Í∞ú ÏÇ¨Ïö©
df2['ÏßÄÏó≠']

ÎèÑÏãú
ÏÑúÏö∏    ÏàòÎèÑÍ∂å
Î∂ÄÏÇ∞    Í≤ΩÏÉÅÍ∂å
Ïù∏Ï≤ú    ÏàòÎèÑÍ∂å
ÎåÄÍµ¨    Í≤ΩÏÉÅÍ∂å
Name: ÏßÄÏó≠, dtype: object

In [45]:
# Ïó¥ 1Í∞úÎ•º Ï†ëÍ∑ºÌï† ÎïåÎäî Ïó∞ÏÇ∞Ïûê ÏÇ¨Ïö©Í∞ÄÎä• : df.Ïª¨ÎüºÎ™Ö
df2.ÏßÄÏó≠

ÎèÑÏãú
ÏÑúÏö∏    ÏàòÎèÑÍ∂å
Î∂ÄÏÇ∞    Í≤ΩÏÉÅÍ∂å
Ïù∏Ï≤ú    ÏàòÎèÑÍ∂å
ÎåÄÍµ¨    Í≤ΩÏÉÅÍ∂å
Name: ÏßÄÏó≠, dtype: object

In [46]:
# ÏßÄÏó≠ Ïª¨Îüº Îç∞Ïù¥ÌÑ∞ Ïú†Ìòï ÌôïÏù∏
type(df2.ÏßÄÏó≠)

pandas.core.series.Series

In [49]:
# Ïó¥ÏùÑ Ï∂îÏ∂úÌï† Îïå dfÎ°ú Î∞òÌôòÎ∞õÍ≥†Ïûê ÌïòÎ©¥ []Î•º ÏÇ¨Ïö©
# Î¶¨Ïä§Ìä∏Î°ú Ïù∏Îç±Ïã± : dfÎ°ú Î∞òÌôò

df2[['2010','2015']]

ÌäπÏÑ±     2010     2015
ÎèÑÏãú
ÏÑúÏö∏  9631482  9904312
Î∂ÄÏÇ∞  3393191  3448737
Ïù∏Ï≤ú  2632035  2890451
ÎåÄÍµ¨  2000002  2466052

In [50]:
# ÏóêÎü¨Í∞Ä ÎÇ¨ÏùÑ Îïå Î¨¥Ïä® ÏóêÎü¨Í∞Ä ÎÇ¨Îäî ÏßÄ ÌôïÏù∏

try : 
    df2[0] # keyerror Î∞úÏÉù
except Exception as e :
    print(type(e))

<class 'KeyError'>

In [52]:
df3 = pd.DataFrame(np.arange(0,12).reshape(3,4))
df3

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [53]:
df3[0]

0    0
1    4
2    8
Name: 0, dtype: int32

In [57]:
df3[[1,3]]

   1   3
0  1   3
1  5   7
2  9  11

In [58]:
df2

ÌäπÏÑ±   ÏßÄÏó≠     2015     2010     2005     2000  2010-2015Ï¶ùÍ∞ÄÏú®  2000-2015Ï¶ùÍ∞ÄÏú®
ÎèÑÏãú
ÏÑúÏö∏  ÏàòÎèÑÍ∂å  9904312  9631482  9762546  9853972       28300.0          1.45
Î∂ÄÏÇ∞  Í≤ΩÏÉÅÍ∂å  3448737  3393191  3512547  3655437       16300.0         -1.82
Ïù∏Ï≤ú  ÏàòÎèÑÍ∂å  2890451  2632035  2517680  2466338       98200.0         14.81
ÎåÄÍµ¨  Í≤ΩÏÉÅÍ∂å  2466052  2000002  2456016  2473990       14100.0          0.41

In [59]:
df2[:1]

ÌäπÏÑ±   ÏßÄÏó≠     2015     2010     2005     2000  2010-2015Ï¶ùÍ∞ÄÏú®  2000-2015Ï¶ùÍ∞ÄÏú®
ÎèÑÏãú
ÏÑúÏö∏  ÏàòÎèÑÍ∂å  9904312  9631482  9762546  9853972       28300.0          1.45

In [60]:
df2[0:1]

ÌäπÏÑ±   ÏßÄÏó≠     2015     2010     2005     2000  2010-2015Ï¶ùÍ∞ÄÏú®  2000-2015Ï¶ùÍ∞ÄÏú®
ÎèÑÏãú
ÏÑúÏö∏  ÏàòÎèÑÍ∂å  9904312  9631482  9762546  9853972       28300.0          1.45

In [61]:
df2[1:3]

ÌäπÏÑ±   ÏßÄÏó≠     2015     2010     2005     2000  2010-2015Ï¶ùÍ∞ÄÏú®  2000-2015Ï¶ùÍ∞ÄÏú®
ÎèÑÏãú
Î∂ÄÏÇ∞  Í≤ΩÏÉÅÍ∂å  3448737  3393191  3512547  3655437       16300.0         -1.82
Ïù∏Ï≤ú  ÏàòÎèÑÍ∂å  2890451  2632035  2517680  2466338       98200.0         14.81

In [64]:
df2['ÏÑúÏö∏':'Î∂ÄÏÇ∞']

ÌäπÏÑ±   ÏßÄÏó≠     2015     2010     2005     2000  2010-2015Ï¶ùÍ∞ÄÏú®  2000-2015Ï¶ùÍ∞ÄÏú®
ÎèÑÏãú
ÏÑúÏö∏  ÏàòÎèÑÍ∂å  9904312  9631482  9762546  9853972       28300.0          1.45
Î∂ÄÏÇ∞  Í≤ΩÏÉÅÍ∂å  3448737  3393191  3512547  3655437       16300.0         -1.82

In [76]:
# Í∞úÎ≥ÑÏöîÏÜå Ï†ëÍ∑º[Ïó¥][Ìñâ]
df2['2015','2005']['ÏÑúÏö∏':'Î∂ÄÏÇ∞']   # Ïó¥ÏùÑ Ïó¨Îü¨Í∞ú Îì§Í≥†Ïò¨ ÎñÑÎäî ÏΩ§ÎßàÎ°ú Íµ¨Î∂Ñ. ÌñâÏùÑ Ïä¨ÎùºÏù¥Ïã±

KeyError: ('2015', '2005')

* Îç∞Ïù¥ÌÑ∞ ÌîÑÎ†àÏûÑÏùÄ Ïó¥Í∏∞Ï§ÄÏúºÎ°ú Ï†ëÍ∑º ÏõêÏπô
* ÌñâÍ∏∞Ï§Ä Ï†ëÍ∑ºÏùÑ ÏúÑÌï¥ÏÑúÎäî Ïä¨ÎùºÏù¥Ïã±ÏùÑ Ï†ÅÏö©
* ÌñâÍ≥ºÏó¥ÏùÑ Í∞ôÏù¥ Ï†ÅÏö© : [Ïó¥Ïù¥Î¶Ñ][ÌñâÏù¥Î¶Ñ]

## üéà Îç∞Ïù¥ÌÑ∞ ÌîÑÎ†àÏûÑ Ïù∏Îç±ÏÑú : loc, iloc

In [71]:
# Ïã§Ìñâ Ï†ÑÏóê ÏïÑÎûò Ìï®ÏàòÎì§ÏùÑ Î™®Îëê Ïã§ÌñâÌïòÎäîÍ≤å Ï¢ãÏùå

import numpy as np
import pandas as pd

from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity="all"     # Ìïú Ïπ∏Ïóê Ïó¨Îü¨ Ìï®Ïàò Í≤∞Í≥ºÍ∞íÏùÑ Í∞úÎ≥ÑÏ†ÅÏúºÎ°ú ÌôïÏù∏ Í∞ÄÎä•

## ‚úî loc Ïù∏Îç±ÏÑú ( Ìñâ Ïö∞ÏÑ† Ïù∏Îç±ÏÑú )

In [81]:
df = pd.DataFrame(np.arange(10,22).reshape(3,4),
                 index=['a','b','c'],
                 columns = ['A','B','C','D'])
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [82]:
df.loc['a']

A    10
B    11
C    12
D    13
Name: a, dtype: int32

In [85]:
df.loc['a':'c']

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [86]:
df.loc[['a','c']]  # locÏùÑ Ïì∞Î©¥ ÌñâÍ∏∞Ï§Ä

    A   B   C   D
a  10  11  12  13
c  18  19  20  21

In [87]:
df[['B','C']]   # locÏùÑ ÏïàÏì∞Î©¥ Ïó¥Í∏∞Ï§Ä

    B   C
a  11  12
b  15  16
c  19  20

In [90]:
df.loc[df.A > 15]

    A   B   C   D
c  18  19  20  21

In [92]:
df[df.A > 15]

    A   B   C   D
c  18  19  20  21

In [93]:
def sel_row(df):
    return df.A > 15

In [94]:
sel_row(df)

a    False
b    False
c     True
Name: A, dtype: bool

In [97]:
df.loc[sel_row(df)]

    A   B   C   D
c  18  19  20  21

## ‚úî loc Ïù∏Îç±ÏÑú Ïä¨ÎùºÏù¥Ïã±

In [101]:
df2 = pd.DataFrame(np.arange(10,26).reshape(4,4),
                  columns=['a','b','c','d'])
df2

    a   b   c   d
0  10  11  12  13
1  14  15  16  17
2  18  19  20  21
3  22  23  24  25

In [102]:
# Í∞í Ïù∏Îç±Ïã±
df2.loc[1:2]

    a   b   c   d
1  14  15  16  17
2  18  19  20  21

In [103]:
# ÏúÑÏπò Ïù∏Îç±Ïã± : Ï¥àÍ∏∞ÏúÑÏπò:ÎÅùÏúÑÏπò+1
df2[1:2]

    a   b   c   d
1  14  15  16  17

In [104]:
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [105]:
df.loc['a','A']

10

In [107]:
df.loc['a','A'] = 50
df

    A   B   C   D
a  50  11  12  13
b  14  15  16  17
c  18  19  20  21

In [108]:
# a Ìñâ Î™®Îì† Ïó¥ Î∞òÌôò
df.loc['a']    # Î∞òÌôòÍ∞íÏù¥ ÏãúÎ¶¨Ï¶àÎ°ú Î∞òÌôò

A    50
B    11
C    12
D    13
Name: a, dtype: int32

In [109]:
df.loc[['a']]  # Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑÏúºÎ°ú Î∞òÌôò

    A   B   C   D
a  50  11  12  13

In [110]:
df.loc['a',:] # ÏãúÎ¶¨Ï¶àÎ°ú Î∞òÌôò

A    50
B    11
C    12
D    13
Name: a, dtype: int32

In [112]:
# aÌñâÏùò B,C Ïó¥ÏùÑ Î∞òÌôò
df
df.loc['a','B':'C']

    A   B   C   D
a  50  11  12  13
b  14  15  16  17
c  18  19  20  21

B    11
C    12
Name: a, dtype: int32

In [116]:
# bÌñâÎ∂ÄÌÑ∞ Î™®Îì† ÌñâÏùò AÏó¥
df.loc['b':,'A']

b    14
c    18
Name: A, dtype: int32

In [122]:
# a,bÌñâÏùò B,DÏó¥ÏùÑ Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑÏúºÎ°ú Î∞òÌôòÌïòÏãúÏò§
df
df.loc[['a','b'],['B','D']]

    A   B   C   D
a  50  11  12  13
b  14  15  16  17
c  18  19  20  21

    B   D
a  11  13
b  15  17

In [123]:
df

    A   B   C   D
a  50  11  12  13
b  14  15  16  17
c  18  19  20  21

In [124]:
# 0Ìñâ 1Ïó¥
df.iloc[0,1]

11

In [125]:
# Îëò Îã§ Ïù∏Îç±Ïã± Ï£ºÎ©¥ Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑ ÌòïÌÉú
df.iloc[0:2,1:2]

    B
a  11
b  15

In [126]:
# ÌïúÏ™ΩÎßå Ï£ºÎ©¥ ÏãúÎ¶¨Ï¶à ÌòïÌÉú
df.iloc[0:2,1]

a    11
b    15
Name: B, dtype: int32

In [128]:
df.iloc[0,2:]

C    12
D    13
Name: a, dtype: int32

In [133]:
df
df.iloc[0,-2:]    # -1ÏùÄ Ï†úÏùº ÎÅù Ïù∏Îç±Ïä§, -2Îäî ÎÅùÏóêÏÑú Îëê Î≤àÏß∏ Ïù∏Îç±Ïä§
df.iloc[0:1,-2:]

    A   B   C   D
a  50  11  12  13
b  14  15  16  17
c  18  19  20  21

C    12
D    13
Name: a, dtype: int32

    C   D
a  12  13

## ‚ùì Ïó∞ÏäµÎ¨∏Ï†ú

In [136]:
df = pd.DataFrame(np.arange(25,50).reshape(5,5),
                 index=['a','b','c','d','e'],
                 columns=['A','B','C','D','E'])
df

    A   B   C   D   E
a  25  26  27  28  29
b  30  31  32  33  34
c  35  36  37  38  39
d  40  41  42  43  44
e  45  46  47  48  49

In [137]:
# AÏó¥ Ï∂îÏ∂ú
df['A']

a    25
b    30
c    35
d    40
e    45
Name: A, dtype: int32

In [139]:
# 0ÌñâÎ∂ÄÌÑ∞ 2ÌñâÍπåÏßÄ Ï∂îÏ∂ú
df.iloc[0:3]

    A   B   C   D   E
a  25  26  27  28  29
b  30  31  32  33  34
c  35  36  37  38  39

In [148]:
# 1ÌñâÏùò 3,4Ïó¥ Ï∂îÏ∂ú
df.iloc[1:2,3:5]
df.iloc[[1],[3,4]]

    D   E
b  33  34

    D   E
b  33  34

In [147]:
# aÌñâÏóêÏÑú cÌñâÍπåÏßÄ Ï§ë BÏó¥Í≥º DÏó¥ Ï∂îÏ∂ú
df.loc['a':'c',['B','D']]

    B   D
a  26  28
b  31  33
c  36  38